Dataset/Kubernetes/30-05-24/13/mediaMicroservices/2/k8s-mm-wrk-compose-c6525-25g-exp13-havail0-hori1-verti0-infi1-client-t8-c512-d30-R3000-N2
No argument supplied nginx
using  args: threads=8 and connections=512 and duration=30 and requests=3000
Running 30s test @ http://localhost:8080/wrk2-api/user-timeline/read
  8 threads and 512 connections
  Thread calibration: mean lat.: 3535.839ms, rate sampling interval: 13033ms
  Thread calibration: mean lat.: 3583.810ms, rate sampling interval: 13385ms
  Thread calibration: mean lat.: 3539.681ms, rate sampling interval: 12976ms
  Thread calibration: mean lat.: 3491.334ms, rate sampling interval: 13099ms
  Thread calibration: mean lat.: 3499.711ms, rate sampling interval: 13066ms
  Thread calibration: mean lat.: 3487.001ms, rate sampling interval: 13099ms
  Thread calibration: mean lat.: 3478.628ms, rate sampling interval: 13066ms
  Thread calibration: mean lat.: 3579.890ms, rate sampling interval: 12484ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.52s     4.33s   22.64s    59.15%
    Req/Sec    99.00      1.00   101.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.50s 
 75.000%   18.14s 
 90.000%   20.40s 
 99.000%   22.64s 
 99.900%   23.66s 
 99.990%   24.35s 
 99.999%   24.58s 
100.000%   24.58s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4575.231     0.000000            1         1.00
    8658.943     0.100000         1609         1.11
   10084.351     0.200000         3219         1.25
   11550.719     0.300000         4814         1.43
   13041.663     0.400000         6421         1.67
   14499.839     0.500000         8024         2.00
   15261.695     0.550000         8833         2.22
   15998.975     0.600000         9629         2.50
   16695.295     0.650000        10429         2.86
   17432.575     0.700000        11236         3.33
   18137.087     0.750000        12047         4.00
   18513.919     0.775000        12444         4.44
   18890.751     0.800000        12851         5.00
   19251.199     0.825000        13240         5.71
   19628.031     0.850000        13637         6.67
   20021.247     0.875000        14053         8.00
   20201.471     0.887500        14245         8.89
   20398.079     0.900000        14439        10.00
   20627.455     0.912500        14650        11.43
   20856.831     0.925000        14848        13.33
   21102.591     0.937500        15054        16.00
   21217.279     0.943750        15141        17.78
   21348.351     0.950000        15246        20.00
   21495.807     0.956250        15351        22.86
   21626.879     0.962500        15447        26.67
   21790.719     0.968750        15547        32.00
   21872.639     0.971875        15600        35.56
   21970.943     0.975000        15646        40.00
   22085.631     0.978125        15697        45.71
   22200.319     0.981250        15745        53.33
   22331.391     0.984375        15798        64.00
   22380.543     0.985938        15818        71.11
   22478.847     0.987500        15843        80.00
   22577.151     0.989062        15869        91.43
   22675.455     0.990625        15894       106.67
   22790.143     0.992188        15919       128.00
   22855.679     0.992969        15934       142.22
   22937.599     0.993750        15945       160.00
   23003.135     0.994531        15959       182.86
   23052.287     0.995313        15969       213.33
   23183.359     0.996094        15981       256.00
   23248.895     0.996484        15987       284.44
   23281.663     0.996875        15993       320.00
   23330.815     0.997266        16001       365.71
   23396.351     0.997656        16006       426.67
   23445.503     0.998047        16012       512.00
   23478.271     0.998242        16015       568.89
   23511.039     0.998437        16018       640.00
   23543.807     0.998633        16022       731.43
   23592.959     0.998828        16025       853.33
   23724.031     0.999023        16028      1024.00
   23740.415     0.999121        16029      1137.78
   23805.951     0.999219        16031      1280.00
   23838.719     0.999316        16033      1462.86
   23855.103     0.999414        16034      1706.67
   23937.023     0.999512        16036      2048.00
   23937.023     0.999561        16036      2275.56
   24018.943     0.999609        16037      2560.00
   24035.327     0.999658        16038      2925.71
   24068.095     0.999707        16039      3413.33
   24215.551     0.999756        16040      4096.00
   24215.551     0.999780        16040      4551.11
   24215.551     0.999805        16040      5120.00
   24346.623     0.999829        16041      5851.43
   24346.623     0.999854        16041      6826.67
   24379.391     0.999878        16042      8192.00
   24379.391     0.999890        16042      9102.22
   24379.391     0.999902        16042     10240.00
   24379.391     0.999915        16042     11702.86
   24379.391     0.999927        16042     13653.33
   24575.999     0.999939        16043     16384.00
   24575.999     1.000000        16043          inf
#[Mean    =    14517.663, StdDeviation   =     4331.917]
#[Max     =    24559.616, Total count    =        16043]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23997 requests in 30.06s, 4.24MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
  Non-2xx or 3xx responses: 162
Requests/sec:    798.18
Transfer/sec:    144.33KB